Revit 2024 API
AssetPropertyList.RemoveAssetProperty Method
 Remove the AssetProperty from the list.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public void RemoveAssetProperty(
	int index
)
Visual Basic
Public Sub RemoveAssetProperty ( _
	index As Integer _
)
Visual C++
public:
void RemoveAssetProperty(
	int index
)
Parameters
index
Type: System.Int32
 Index to remove the AssetProperty from.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  index is out of range.
Autodesk.Revit.Exceptions.InvalidOperationException |  The asset property is not editable.
See Also
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace